snlkuharlocal/src/InformationRegisters/ЖурналИзмененийРеквизитов/ЖурналИзмененийРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналИзмененийРеквизитов</name>
  <resources>
    <name>СтароеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НовоеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СостоянияЗаказаКонтрагента/СостоянияЗаказаКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказаКонтрагента</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденныйЗаказ</name>
  </enumValues>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
  <enumValues>
    <name>ЗаказаноПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыполненЧастично</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/CommonModules/ОбработчикиСобытий/Module.bsl
Процедура Объект_ПередЗаписью(Источник, Отказ)
	Если ПараметрыСеанса.ОтключитьЖурнализациюЗаписи Тогда Возврат КонецЕсли;	
	Если Отказ Тогда Возврат КонецЕсли;
	
	//+++Чирков 25.05.2025 - в некоторых документах выполняется куча действий в процедуре "ПередЗаписью"
	//лучше Начало ставить там
	//Источник.ДополнительныеСвойства.Вставить("Начало",ТекущаяУниверсальнаяДатаВМиллисекундах());
	Если НЕ Источник.ДополнительныеСвойства.Свойство("Начало") Тогда	
		Источник.ДополнительныеСвойства.Вставить("Начало",ТекущаяУниверсальнаяДатаВМиллисекундах());
	КонецЕсли;	
	//---Чирков 25.05.2025 - в некоторых документах выполняется куча действий в процедуре "ПередЗаписью"
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьЖурнализациюЗаписи") Тогда Возврат КонецЕсли;
	
	Загрузка	= Источник.ОбменДанными.Загрузка;
	Отправитель = Неопределено;
	
	Если Загрузка Тогда
		Отправитель=Источник.ОбменДанными.Отправитель;
		Если НЕ ЗначениеЗаполнено(Отправитель) Тогда
			Отправитель=ПараметрыСеанса.Отправитель;	
		КонецЕсли;
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("ПараметрыЗагрузки",	Новый Структура("Загрузка,Отправитель",Загрузка,Отправитель));	
	Источник.ДополнительныеСвойства.Вставить("НачальноеСостояние",	ПолучитьСостояниеОбъекта(Источник.Ссылка,Источник.Модифицированность()));	
КонецПроцедуры

Процедура Объект_ПриЗаписи(Источник, Отказ)
	Если ПараметрыСеанса.ОтключитьЖурнализациюЗаписи Тогда Возврат КонецЕсли;  
	
	//+++Чирков 04.04.2025
	ОценкаПроизводительностиКлиентСервер.ЗаписатьЗамерПроизводительности_ПриЗаписи(Источник);
	//---Чирков 04.04.2025
	
	НачальноеСостояние=Неопределено;
	Если Источник.ДополнительныеСвойства.Свойство("НачальноеСостояние", НачальноеСостояние) Тогда
		РежимЗаписи = МаркировкаКС.ПолучитьЗначениеПараметра(Источник.ДополнительныеСвойства, "РежимЗаписи");
		
		ЗаписатьИзмененияВЖурнал(Источник.Ссылка, НачальноеСостояние, Источник.ДополнительныеСвойства.ПараметрыЗагрузки, Новый Структура("РежимЗаписи", РежимЗаписи));
	КонецЕсли;	
КонецПроцедуры

Процедура Справочник_ПередЗаписью(Источник, Отказ) Экспорт
	Объект_ПередЗаписью(Источник, Отказ);	
КонецПроцедуры

Процедура Документ_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
// Кухарь А.Ю. 02.03.2021 начало
//   Пока что убрал, сказали что не нужно
	// Если ОценкаПроизводительностиВызовСервераПовтИсп.ВыполнятьЗамерыПроизводительности() Тогда
	//	Источник.ДополнительныеСвойства.Вставить("НачалоЗаписи",ОценкаПроизводительности.НачатьЗамерВремени());
	//КонецЕсли;	
// Кухарь А.Ю. 02.03.2021 конец

	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи",  РежимЗаписи);
	
	Объект_ПередЗаписью(Источник, Отказ);
КонецПроцедуры

Процедура Справочник_ПриЗаписи(Источник, Отказ) Экспорт
	Объект_ПриЗаписи(Источник, Отказ);	
КонецПроцедуры

Процедура Документ_ПриЗаписи(Источник, Отказ) Экспорт
	
	Объект_ПриЗаписи(Источник, Отказ);
	
КонецПроцедуры

Процедура Справочник_ПередУдалением(Источник,Отказ) Экспорт	
	//Чирков - я конечно понимаю - так якобы проще всего - но иногда нужно все таки удалять справочкики 
	Если ПараметрыСеанса.СверткаБазы Тогда
		ПараметрыЗагрузки=Неопределено;
		Источник.ДополнительныеСвойства.Свойство("ПараметрыЗагрузки",ПараметрыЗагрузки);
		ЗаписатьУдалениеВЖурнал(Источник.Ссылка,ПараметрыЗагрузки);
	Иначе
		//крохин начало 25.01.2012
		//запрещаем удалять справочники 
		//Отказ = Истина;
		///Возврат;
		//крохин конец 25.01.2012
		
		//крохин начало 11.04.2013
		//запрещаем удалять справочники - чтобы не разбираться с косяками "удалили обработкой"
		Отказ = Истина;
		Возврат;	
		//крохин конец 11.04.2013		
	КонецЕсли;	
КонецПроцедуры

Процедура Документ_ПередУдалением(Источник,Отказ) Экспорт
	Если ПараметрыСеанса.СверткаБазы Тогда 
		ПараметрыЗагрузки = Неопределено;
		Источник.ДополнительныеСвойства.Свойство("ПараметрыЗагрузки",ПараметрыЗагрузки);
		//+++Чирков 18.09.2025 - слишком много документов - да и не нужно это наверное
		//ЗаписатьУдалениеВЖурнал(Источник.Ссылка,ПараметрыЗагрузки);		
		//---Чирков 18.09.2025
	Иначе
		//крохин начало 25.01.2012
		//запрещаем удалять справочники 
		//Отказ = Истина;
		//Возврат;
		//крохин конец 25.01.2012
		
		//крохин начало 11.04.2013
		//запрещаем удалять справочники - чтобы не разбираться с косяками "удалили обработкой"
		Отказ = Истина;
		Возврат;	
		//крохин конец 11.04.2013		
	КонецЕсли;	
КонецПроцедуры

Процедура Документ_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	ОценкаПроизводительностиКлиентСервер.ЗаписатьЗамерПроизводительности_ОбработкаПроведения(Источник);	
КонецПроцедуры

//Кухарь 25.01.16 начало
//Будем фиксировать основной вид номенклатуры в накладной
Процедура СкладскиеДокументыПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//крохин начало 13.02.2020
	//не записываем при обмене и в фоновых заданиях
	//если Источник.товары.количество()>0 тогда		
	//	ЗаписатьЗначениеВРеквизитыРНКПНКПРМ("ОсновнойВидНоменклатуры",Источник.товары.получить(0).номенклатура.родитель.ВидНоменклатуры,Источник.ссылка);	
	//КонецЕсли;
	#Если Клиент Тогда
	Если НЕ Источник.ОбменДанными.Загрузка Тогда
	если Источник.товары.количество()>0 тогда		
		ЗаписатьЗначениеВРеквизитыРНКПНКПРМ("ОсновнойВидНоменклатуры",Источник.товары.получить(0).номенклатура.родитель.ВидНоменклатуры,Источник.ссылка);	
	КонецЕсли;	
    КонецЕсли;
    #КонецЕсли 
	//крохин конец 13.02.2020

КонецПроцедуры
//Кухарь 25.01.16 конец

Процедура ЗаписьРегистраСведенийПередЗаписью(Источник, Отказ, Замещение) Экспорт
	//если замещение тогда 
	//	сообщить ("Замещение");
	//иначе
	//	Сообщить("Не замещение");
	//КонецЕсли;   
	
	попытка	
		ОбменДанными=Источник.ОбменДанными;	
	Исключение
		ОбменДанными=Неопределено;
	КонецПопытки;
	
	
	если ОбменДанными<>Неопределено тогда
		загрузка=ОбменДанными.загрузка;
	иначе
		загрузка=ложь;
	КонецЕсли;
	
	//Кухарь 20.11.17 начало
	//На складе и без того всё висит.
	если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.Склад тогда
		//Кухарь 20.11.17 конец		
		СтароеЗначение=ПолучитьСтароеЗначение(Источник);
		Для каждого стр из СтароеЗначение Цикл 
			ЗаписатьВЖурналИзмененийРеквизитов(стр.Документ,стр.ИмяРеквизита,стр.ЗначениеРеквизита,0,ОбменДанными,Истина,источник);
		КонецЦикла;
		если не Замещение или загрузка тогда
			Для Каждого Запись Из источник Цикл
				ЗаписатьВЖурналИзмененийРеквизитов(Запись.Документ,запись.ИмяРеквизита,"",Запись.ЗначениеРеквизита,ОбменДанными,ложь,источник);
			КонецЦикла; 
		КонецЕсли;
		//Кухарь 20.11.17 начало
		//На складе и без того всё висит.
	КонецЕсли;
	//Кухарь 20.11.17 конец		
	
КонецПроцедуры

Процедура ЗаписатьВЖурналИзмененийРеквизитов(Документ,ИмяРеквизита,СтароеЗначение,НовоеЗначение,ОбменДанными,ПерваяЗапись,источник)
	
	//если замещение тогда 
	//	сообщить ("Замещение");
	//иначе
	//	Сообщить("Не замещение");
	//КонецЕсли;   
	//Кухарь 04.06.19 начало
	//По просьбе Никиты. Т.к. висит.
	Возврат;
	//Кухарь 04.06.19 конец	
	
	
	если ОбменДанными<>Неопределено тогда
		загрузка=ОбменДанными.загрузка;
	иначе
		загрузка=ложь;
	КонецЕсли;
	
	если ПерваяЗапись Тогда 
		Запись=РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьМенеджерЗаписи();	
		Запись.Дата				=ТекущаяДата();
		Запись.Документ			=Документ;
		Запись.ТипДокумента		=Документ.метаданные().имя;
		Запись.ИмяРеквизита		=ИмяРеквизита;
		Запись.СтароеЗначение	=СтароеЗначение;
		Запись.НовоеЗначение	=0;
		Запись.Пользователь		=ПараметрыСеанса.Пользователь;
		Если загрузка Тогда
			Запись.Отправитель		=ОбменДанными.Отправитель;		
			Запись.НомерСообщения	=ПараметрыСеанса.НомерСообщения;
		КонецЕсли;		
		Запись.Записать();
	иначе		
		ДанныеВБазе=РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьНаборЗаписей();		
		ДанныеВБазе.Отбор.Документ.Установить(Источник.Отбор.Документ.Значение);
		ДанныеВБазе.Отбор.ИмяРеквизита.Установить(источник.Отбор.ИмяРеквизита.Значение);	
		ДанныеВБазе.Прочитать();
		Для Каждого Запись Из ДанныеВБазе Цикл
			СтароеЗначение=Запись.СтароеЗначение;
		КонецЦикла;
		//кухарь 23.10.14 начало 
		//  20.05.2019 начало
		//  Вернул как было
		если СтароеЗначение<>НовоеЗначение тогда 
			//  20.05.2019 конец
			
			//если СтароеЗначение<>НовоеЗначение тогда
			//Запись=РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьМенеджерЗаписи();
			если запись<>Неопределено тогда
				Запись.Дата				=ТекущаяДата();
				Запись.Документ			=Документ;
				Запись.ТипДокумента		=Документ.метаданные().имя;
				Запись.ИмяРеквизита		=ИмяРеквизита;
				Запись.СтароеЗначение	=СтароеЗначение;
				Запись.НовоеЗначение	=НовоеЗначение;
				Запись.Пользователь		=ПараметрыСеанса.Пользователь;
				Если загрузка Тогда
					Запись.Отправитель		=ОбменДанными.Отправитель;		
					Запись.НомерСообщения	=ПараметрыСеанса.НомерСообщения;
				КонецЕсли;	
				если СтароеЗначение<>НовоеЗначение тогда
					Запись.Дата	=ТекущаяДата();				
				иначе 
					Запись.Дата	=ТекущаяДата()-100*365*24*3600;
				КонецЕсли;
				
				//Запись.Записать(); 
				ДанныеВБазе.Записать();
			иначе
				Запись=РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьМенеджерЗаписи();
				Запись.Дата				=ТекущаяДата();
				Запись.Документ			=Документ;
				Запись.ТипДокумента		=Документ.метаданные().имя;
				Запись.ИмяРеквизита		=ИмяРеквизита;
				Запись.СтароеЗначение	=СтароеЗначение;
				Запись.НовоеЗначение	=НовоеЗначение;
				Запись.Пользователь		=ПараметрыСеанса.Пользователь;
				Если загрузка Тогда
					Запись.Отправитель		=ОбменДанными.Отправитель;		
					Запись.НомерСообщения	=ПараметрыСеанса.НомерСообщения;
				КонецЕсли;	
				если СтароеЗначение<>НовоеЗначение тогда
					Запись.Дата	=ТекущаяДата();				
				иначе 
					Запись.Дата	=ТекущаяДата()-10*365*24*3600;
				КонецЕсли;				
				Запись.Записать(); 	
			КонецЕсли;
			//кухарь 23.10.14 конец
			//  20.05.2019 начало
			//  Вернул как было
		КонецЕсли;
		//  20.05.2019 конец
		
	КонецЕсли;
КонецПроцедуры 

Функция ПолучитьСтароеЗначение(Источник)
	ДанныеВБазе=РегистрыСведений[Источник.метаданные().имя].СоздатьНаборЗаписей();
	
	ДанныеВБазе.Отбор.Документ.Установить(Источник.Отбор.Документ.Значение);
	ДанныеВБазе.Отбор.ИмяРеквизита.Установить(Источник.Отбор.ИмяРеквизита.Значение);	
	
	ДанныеВБазе.Прочитать();
	ТЗ=новый ТаблицаЗначений;
	тз.колонки.Добавить("ЗначениеРеквизита");
	тз.колонки.Добавить("Документ");
	тз.колонки.Добавить("ИмяРеквизита");
	Для Каждого Запись Из ДанныеВБазе Цикл
		стр=тз.Добавить();
		ЗаполнитьЗначенияСвойств(стр,Запись);
	КонецЦикла;
	возврат ТЗ;
КонецФункции	
//Кухарь 21.12.16 конец

//Шворобей ВЮ  09.02.2022 начало
//
Процедура РНК_ПодтвержденныйЗаказПриЗаписи(Источник, Отказ) Экспорт
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НЕ ЗначениеЗаполнено(Источник.ДокОснование) Тогда Возврат; КонецЕсли;
	Если Отказ Тогда Возврат; КонецЕсли;
	
	Если ТипЗнч(Источник.ДокОснование) <> Тип("ДокументСсылка.Заказ") Тогда
		Возврат;
	КонецЕсли;
	//++Данилова Е.В. 26.08.2024
	b2b_ОбменЗаявками.ОтработатьОтгрузкуРНК(Источник.ссылка); 
	//--Данилова Е.В. 26.08.2024
	
	Если ЗначениеРеквизитаОбъекта(Источник.ДокОснование, "СостояниеНакладной") <> Перечисления.СостоянияЗаказаКонтрагента.ВРаботе Тогда
		Возврат;
	КонецЕсли;    
	
	// Кухарь А.Ю.  08.11.2023 начало
	//
	если ТипЗнч(Источник)= Тип("ДокументОбъект.Перемещение")  тогда
		Если Источник.склад <> ПолучитьРеквизитШапки(Источник.ДокОснование,"Склад","Документ")  тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю.  08.11.2023 конец
	
	
	
	// Кухарь А.Ю.  29.08.2023 начало
	// 	Документы.Заказ.ОбработатьЗаказПриСозданииРНК(Источник.ДокОснование);	
	если не Источник.ПометкаУдаления тогда 		
		Документы.Заказ.ОбработатьЗаказПриСозданииРНК(Источник.ДокОснование,Источник.ссылка); 
	КонецЕсли; 
	// Кухарь А.Ю.  29.08.2023 конец
	
	
КонецПроцедуры
////Шворобей ВЮ   09.02.2022 конец

// Шворобей ВЮ 05.02.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-701
Процедура УдалениеСвязанныхДокументовРНК_ПНК(Источник, Отказ) Экспорт
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если Источник.ПометкаУдаления Тогда
		//++Данилова Е.В. 27.10.2025  HELP-7587 
		Если Источник.ДополнительныеСвойства.Свойство("НепомечатьПодчиненные")
			И Источник.ДополнительныеСвойства.НепомечатьПодчиненные = Истина Тогда
			
			Возврат; 	
			
		КонецЕсли;
		//--Данилова Е.В. 27.10.2025
		МассивПодчиненных = Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Документы.Ссылка КАК Ссылка
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументыПНК_РНК(&ДокОснование) КАК Документы
		|ГДЕ
		|	НЕ Документы.Ссылка.ПометкаУдаления";
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос.УстановитьПараметр("ДокОснование", Источник.Ссылка);

		Выборка = Запрос.Выполнить().Выбрать();
		
		ПараметрыСеанса.ЗапущенаОбработка = Истина;
		//++Данилова Е.В. 27.10.2025  HELP-7587 
		//НачатьТранзакцию();
		//--Данилова Е.В. 27.10.2025
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если ДокОбъект <> Неопределено Тогда
				Попытка
					ДокОбъект.УстановитьПометкуУдаления(Истина);
					Если ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.РекламационнаяНакладная") Тогда
						МассивПодчиненных.Добавить(ДокОбъект.Ссылка);	
					КонецЕсли;
				Исключение
					СообщитьИзМодуля(ИнформацияОбОшибке());
					ПараметрыСеанса.ЗапущенаОбработка = Ложь;
					//++Данилова Е.В. 27.10.2025  HELP-7587
					//ОтменитьТранзакцию();
					//--Данилова Е.В. 27.10.2025
					Возврат;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивПодчиненных.Количество() > 0 Тогда
			Для Каждого ЭлементСсылка Из МассивПодчиненных Цикл
				
				Запрос.УстановитьПараметр("ДокОснование", ЭлементСсылка);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
					Если ДокОбъект <> Неопределено Тогда
						Попытка
							ДокОбъект.УстановитьПометкуУдаления(Истина);
						Исключение
							СообщитьИзМодуля(ИнформацияОбОшибке());
							ПараметрыСеанса.ЗапущенаОбработка = Ложь; 
							//++Данилова Е.В. 27.10.2025  HELP-7587
							//ОтменитьТранзакцию();
							//--Данилова Е.В. 27.10.2025
							Возврат;
						КонецПопытки;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		
		ПараметрыСеанса.ЗапущенаОбработка = Ложь;
		//++Данилова Е.В. 27.10.2025  HELP-7587
		//ЗафиксироватьТранзакцию();
		//--Данилова Е.В. 27.10.2025
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;

КонецПроцедуры

// Шворобей ВЮ 05.02.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-701

 // Кухарь А.Ю.  11.06.2026 начало
// Проблема 0000000086
Процедура АвансовыеДокументыПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт     
	если ОбщегоНазначения_ПИ.ЭтоУзел_ЦО() тогда
		ДвиженияВДР =  Источник.Движения.ВзаиморасчетыПоДокументамРасчетов;
		ДвиженияВДР.Прочитать();
		Источник.ДополнительныеСвойства.Вставить("ВзаиморасчетыПоДокументамРасчетов",ДвиженияВДР.Выгрузить());  
	КонецЕсли;
КонецПроцедуры

Процедура АвансовыеДокументыПриПроведении(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт    
	если ОбщегоНазначения_ПИ.ЭтоУзел_ЦО() тогда		
		если Источник.ДополнительныеСвойства.Свойство("ВзаиморасчетыПоДокументамРасчетов") тогда      
			Источник.Движения.ВзаиморасчетыПоДокументамРасчетов.Загрузить(Источник.ДополнительныеСвойства.ВзаиморасчетыПоДокументамРасчетов);
			Источник.Движения.ВзаиморасчетыПоДокументамРасчетов.Записать();
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры
 
// Кухарь А.Ю.  11.06.2026 конец
